$ ./a.py
> (1) (2) +
> 0:0
> 1:1
> 20
0: 0
1: 1
2: 1
3: 2
4: 3
5: 5
6: 8
7: 13
8: 21
9: 34
10: 55
11: 89
12: 144
13: 233
14: 377
15: 610
16: 987
17: 1597
18: 2584
19: 4181
20: 6765
$ ./a.py
> 0 (1) 2 * 1 + -
> 5:31
> 14
5: 31
6: -63
7: 125
8: -251
9: 501
10: -1003
11: 2005
12: -4011
13: 8021
14: -16043
$ ./a.py
> (1) (4) * (2) 4 - +
> 0:3
> 1:-2
> 3:7
> 4:11
> 20
0: 3
1: -2
3: 7
4: 11
5: -19
$ ./a.py
> (2) (4) (6) + +
> 0:0
> 2:0
> 4:1
> 30
0: 0
2: 0
4: 1
6: 1
8: 2
10: 4
12: 7
14: 13
16: 24
18: 44
20: 81
22: 149
24: 274
26: 504
28: 927
30: 1705
